Revit 2027 API
ParameterTypeId.DisplacedElementDisplacementX Property
 "X Displacement"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DisplacedElementDisplacementX { get; }
Public Shared ReadOnly Property DisplacedElementDisplacementX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DisplacedElementDisplacementX {
	ForgeTypeId^ get ();
}
static member DisplacedElementDisplacementX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace